### Connected to MySQL

In [78]:
# jupyter test connection with MySQL .
import mysql.connector

mydb = mysql.connector.connect(
    user='root',
    passwd='root',
    host='localhost'  
)

print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x00000180FFB76EC8>

### Create Database

In [82]:
import mysql.connector

mydb = mysql.connector.connect(
    user='root',
    passwd='root',
    host='localhost'
)

mycursor = mydb.cursor()

mycursor.execute("CREATE DATABASE learning_sql_database")

### Try to connect to this new database.

In [83]:
import mysql.connector

mydb = mysql.connector.connect(
    user='root',
    passwd='root',
    host='localhost',
    database='learning_sql_database'
)

print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x0000018080B15088>

### Create table

In [84]:
import mysql.connector

mydb = mysql.connector.connect(
    user='root',
    passwd='root',
    host='localhost',
    database='learning_sql_database'
)

mycursor = mydb.cursor()

mycursor.execute(
"""CREATE TABLE sql_lesson_1_movies
(
    Id INT PRIMARY KEY AUTO_INCREMENT PRIMARY KEY,
    Title VARCHAR(50),
    Director VARCHAR(50),
    Year INT,
    Length_minutes INT)"""
)

### Add one or multiple record('s)

In [87]:
mycursor = mydb.cursor()

sql = "INSERT INTO sql_lesson_1_movies (Id, Title, Director, Year, Length_minutes) VALUES (%s, %s, %s, %s, %s)"
val = (1, "Toy Story", "John Lasseter", 1995, 81)

mycursor.execute(sql, val)

mydb.commit()
print(mycursor.rowcount, 'record(s) inserted.')

1 record(s) inserted.

In [89]:
mycursor = mydb.cursor()

sql = "REPLACE INTO sql_lesson_1_movies (Id, Title, Director, Year, Length_minutes) VALUES (%s, %s, %s, %s, %s)"
val = [
    (0, "Toy Story", "John Lasseter", 1995, 81),
    (1, "A Bug's Life", "John Lasseter", 1998, 95),
    (2, "Toy Story 2", "John Lasseter", 1999, 93),
    (3, "Monsters, Inc.", "Pete Docter", 2001, 92),
    (4, "Finding Nemo", "Andrew Stanton", 2003, 107),
    (5, "The Incredibles", "Brad Bird", 2004, 116),
    (6, "Cars", "John Lasseter", 2006, 117),
    (7, "Ratatouille", "Brad Bird", 2007, 115),
    (8, "WALL-E", "Andrew Stanton", 2008, 104),
    (9, "Up", "Pete Docter", 2009, 101)
]

mycursor.executemany(sql, val)

mydb.commit()
print(mycursor.rowcount, 'record(s) inserted.')

12 record(s) inserted.

### Show data from database's table using Pandas

In [90]:
import pandas as pd

pd.read_sql_query('SELECT * FROM sql_lesson_1_movies', mydb)

   Id            Title        Director  Year  Length_minutes
0   1     A Bug's Life   John Lasseter  1998              95
1   2      Toy Story 2   John Lasseter  1999              93
2   3   Monsters, Inc.     Pete Docter  2001              92
3   4     Finding Nemo  Andrew Stanton  2003             107
4   5  The Incredibles       Brad Bird  2004             116
5   6             Cars   John Lasseter  2006             117
6   7      Ratatouille       Brad Bird  2007             115
7   8           WALL-E  Andrew Stanton  2008             104
8   9               Up     Pete Docter  2009             101